Repository: halak0013/deneyap_linux_gnu_web
Catalog: po/*.po
Languages: ar, tr

source: Ok
ar: نعم
tr: Tamam

source: Cancel
ar: يلغي
tr: İptal et

source: Boards informations:
ar: معلومات المجالس:
tr: Kart bilgileri:

source: Remove all system and reset
ar: إزالة كافة النظام وإعادة تعيين
tr: Tüm sistemi kaldırın ve sıfırlayın

source: main
ar: رئيسي
tr: ana

source: You don't have Deneyap compiler on your system. Do you want to install?
ar: ليس لديك مترجم دينياب على نظامك. هل تريد التثبيت؟
tr: Sisteminizde Deneyap derleyicisi yok. Yüklemek istiyor musunuz?

source: Install
ar: ثَبَّتَ
tr: Yükle

source: install
ar: ثَبَّتَ
tr: yükle

source: Detial
ar: ديتيال
tr: Ayrıntı

source: None
ar: لا أحد
tr: Hiçbiri

source: wait
ar: انتظر
tr: Bekle

source: Deneyap
ar: دَنَيْيَاب

source: Quit
ar: يترك
tr: Çıkış yap

source: Open
ar: يفتح
tr: Aç

source: Log
ar: سجل
tr: Hata kayıtları

source: Are you sure you want to remove files and reset it?
ar: هل أنت متأكد أنك تريد إزالة الملفات وإعادة تعيينها؟
tr: Dosyaları kaldırıp sıfırlamak istediğinizden emin misiniz?

source: Generating project paths...
ar: إنشاء مسارات المشروع...
tr: Proje yolları oluşturuluyor...

source: Downloading arduino-cli and installing...
ar: تحميل وتثبيت الاردوينو cli...
tr: Arduino-cli indiriliyor ve kuruluyor...

source: Deneyap Board configuration preaparing...
ar: إعداد تكوين لوحة دَنَيْيَاب...
tr: Deneyap Kart ayarları hazırlanıyor...

source: Downloading Deneyap Board core...
ar: جارٍ تنزيل دَنَيْيَاب لوحة الأساسية...
tr: Deneyap Kart çekirdeği indiriliyor...

source: Deneyap Board core installing...
ar: تثبيت لوحة دَنَيْيَاب الأساسية...
tr: Deneyap Kart çekirdek kuruluyor...

source: Deneyap Board index updating...
ar: تحديث فهرس لوحة دَنَيْيَاب...
tr: Deneyap Board dizilneri güncelleniyor...

source: Installing succesed, please close Deneyap app from your taskbar icon and restart it
ar: تم التثبيت بنجاح، يرجى إغلاق تطبيق دَنَيْيَاب من أيقونة شريط المهام وإعادة تشغيله
tr: Kurulum başarılı oldu, lütfen Deneyap uygulamasını görev çubuğu simgenizden (panel) kapatıp yeniden başlatın.

source: An error occured.
ar: حدث خطأ.
tr: Bir hata oluştu.

source: Compiling Code
ar: تجميع الكود
tr: Kod derleniyor

source: Compilation done
ar: تم التجميع
tr: Derleme tamamlandı

source: Uploading completed
ar: تم الرفع

source: Unknown
ar: مجهول
tr: Bilinmeyen

source: You don't have permission to access the port. Do you want to give permission?
ar: ليس لديك إذن للوصول إلى المنفذ. هل تريد إعطاء الإذن؟

source: App version
ar: نسخة التطبيق
tr: Uygulama sürümü

source: Compiling rejected. Try again
tr: Derleme reddedildi. Tekrar deneyin
